In [1]:
import pandas as pd
from urllib.request import urlopen
import json

In [2]:
data = '{"emp_Name":"James","email":"james@gmail.com","job_profile":[{"title1":"Team Lead","title2":"Sr. Developer"}]}'

In [3]:
df1=pd.read_json(data)
df1

  emp_Name            email                                        job_profile
0    James  james@gmail.com  {'title1': 'Team Lead', 'title2': 'Sr. Develop...

In [4]:
df = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data',header=None)

In [5]:
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
1,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
2,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
3,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
4,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735

In [9]:
df.to_csv('wine1.csv')

In [10]:
df1

  emp_Name            email                                        job_profile
0    James  james@gmail.com  {'title1': 'Team Lead', 'title2': 'Sr. Develop...

In [ ]:
df_json = df1.to_json(orient='records')
df_json

In [ ]:
df.to_json(orient="records")

In [18]:
#Read Html content
url = 'https://www.fdic.gov/bank/individual/failed/banklist.html'
dfs = pd.read_html(url)

ValueError: No tables found

In [12]:
dfs[0]  #first table

NameError: name 'dfs' is not defined

In [13]:
dfs

NameError: name 'dfs' is not defined

In [ ]:
type(dfs)

In [14]:
url_mcc = 'https://en.wikipedia.org/wiki/mobile_country_code'
dfs = pd.read_html(url_mcc,match='Country', header=0)

In [17]:
dfs[0]

,Mobile country code,Country,ISO 3166,Mobile network codes,National MNC authority,Remarks
0,289,A Abkhazia,GE-AB,List of mobile network codes in Abkhazia,NaN,MCC is not listed by ITU
1,412,Afghanistan,AF,List of mobile network codes in Afghanistan,NaN,NaN
2,276,Albania,AL,List of mobile network codes in Albania,NaN,NaN
3,603,Algeria,DZ,List of mobile network codes in Algeria,NaN,NaN
4,544,American Samoa (United States of America),AS,List of mobile network codes in American Samoa,NaN,NaN
...,...,...,...,...,...,...
247,452,Vietnam,VN,List of mobile network codes in the Vietnam,NaN,NaN
248,543,W Wallis and Futuna,WF,List of mobile network codes in Wallis and Futuna,NaN,NaN
249,421,Y Yemen,YE,List of mobile network codes in the Yemen,NaN,NaN
250,645,Z Zambia,ZM,List of mobile network codes in Zambia,NaN,NaN
251,648,Zimbabwe,ZW,List of mobile network codes in Zimbabwe,NaN,NaN

In [ ]:
#Reading Excel files
df_excel =pd.read_excel('Excel_Sample.xlsx',index_col=0)

In [ ]:
df_excel.head()

Pickling
All pandas objects are equiped with to_pickle method which use python's cPickle module to save Data Structure to disk to using the pickle format

In [ ]:
df_excel.to_pickle('df_excel')

In [ ]:
df = pd.read_pickle('df_excel')

In [ ]:
df.head()

In [ ]:
import matplotlib.pyplot as plt
plt.scatter()